/*global $, document, window, WOW, Typed*/
$(document).ready(function () {
  
  "use strict";
  
  // Calculate Header Height
  
  $(window).on("resize", function () {
    
    $(".header .header-caption, .header .program-caption").outerHeight($(window).height() - $(".header .navigation-bar").outerHeight() - 150);
    
  });
  
  $(".header .header-caption, .header .program-caption").outerHeight($(window).height() - $(".header .navigation-bar").outerHeight() - 150);
  
  // Toggle Active Class
  
  $(".navigation-bar .navbar-nav .nav-item .nav-link").on("click", function () {
    
    $(this).parent().addClass("active").siblings(".nav-item").removeClass("active");
    
  });
  
  /* Scroll To Next Section On Click */
  
  $(".header .scroll-to-bottom").on("click", function () {
    
    $("html, body").animate({
      
      scrollTop: $(".moral").offset().top
      
    }, 1000);
    
  });
  
  /* Change The Arrangment Of The Column In 540px Devices (Program Page)*/
  
  if ($(window).outerWidth() <= 550) {

    $(".header .program-details .row > div").removeClass("col");
    $(".header .program-details .row > div").addClass("col-6");

  } else {
    
    $(".header .program-details .row > div").removeClass("col-6");
    $(".header .program-details .row > div").addClass("col");
    
  }
  
  $(window).on("resize", function () {

    if ($(window).outerWidth() <= 550) {

      $(".header .program-details .row > div").removeClass("col");
      $(".header .program-details .row > div").addClass("col-6");

    } else {
      
      $(".header .program-details .row > div").removeClass("col-6");
      $(".header .program-details .row > div").addClass("col");
      
    }
    
  });
  
  /* Change The Positiong Of the Triangle Of The Comments System */
  $(".moral .comments .triangle:even").css({
    "right": "30%"
  });
  $(".moral .comments .triangle:odd").css({
    left: "30%"
  });
  
  $(".moral .comments form .submit-button").removeClass("text-left");
  
  /* Change The Arrangment Of The Column In 540px Devices (Program Page)*/
  if ($(window).outerWidth() <= 550) {

    $(".header .program-details .row > div").removeClass("col");
    $(".header .program-details .row > div").addClass("col-6");

  } else {
    
    $(".header .program-details .row > div").removeClass("col-6");
    $(".header .program-details .row > div").addClass("col");
    
  }
  
  /* Change The Arrangment Of The Column In 375 Devices (Contact Page)*/
  if ($(window).outerWidth() <= 375) {

    $(".header .contact-details .row > div").removeClass("col-6");
    $(".header .contact-details .row > div").addClass("col-12");

  } else {
    
    $(".header .contact-details .row > div").removeClass("col-12");
    $(".header .contact-details .row > div").addClass("col-6");
    
  }
  
  $(window).on("resize", function () {
    // Program Page
    if ($(window).outerWidth() <= 550) {

      $(".header .program-details .row > div").removeClass("col");
      $(".header .program-details .row > div").addClass("col-6");

    } else {
      
      $(".header .program-details .row > div").removeClass("col-6");
      $(".header .program-details .row > div").addClass("col");
      
    }
    
    // Contact Page
    if ($(window).outerWidth() <= 375) {

      $(".header .contact-details .row > div").removeClass("col");
      $(".header .contact-details .row > div").addClass("col-12");

    } else {

      $(".header .contact-details .row > div").removeClass("col-12");
      $(".header .contact-details .row > div").addClass("col");

    }
    
  });

  // Prevent Default For Like Button
  $(".moral .comments .like-button button").on("click", function (e) {
    
    e.preventDefault();
    
  });
  
  // 
  
  // Trigger Wow.js Library
  new WOW().init();
  
  // Trigger Typed.js Library
  var typed = new Typed('.moral .past-and-present .past-and-present-text', {
    strings: ["هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.", "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً."],
    typeSpeed: 5,
    showCursor: true,
    autoInsertCss: true
  });
  
  var typed = new Typed('.moral .parents .parents-text', {
    strings: ["هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.", "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً."],
    typeSpeed: 5,
    showCursor: true,
    autoInsertCss: true
  });
  
  var typed = new Typed('.moral .motherland .motherland-text', {
    strings: ["هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.", "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً."],
    typeSpeed: 5,
    showCursor: true,
    autoInsertCss: true
  });
  
  var typed = new Typed('.moral .clean-the-lifeline .clean-the-lifeline-text', {
    strings: ["هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً.", "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق. هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً."],
    typeSpeed: 5,
    showCursor: true,
    autoInsertCss: true
  });
  
});